-- 영화를 등록하는데, 외래키가 없는 테이블부터 데이터를 넣어준다. 

-- 장르 등록 genre(최초 한번만 등록하면 됨)
INSERT INTO genre 
	VALUES('액션'), ('어드벤처'), ('SF'), ('스릴러'), ('드라마'), ('판타지'), 
		  ('서부'), ('공포'), ('멜로/로맨스'), ('느와르'), ('컬트'), ('다큐멘터리'), 
          ('코미디'), ('가족'), ('미스터리'), ('전쟁'), ('애니메이션'), ('범죄'),
          ('뮤지컬'), ('무협'), ('에로'), ('서스펜스'), ('서사'), ('블랙코미디'), ('실험');

-- 영화인 등록 movie_person(등록되지 않은 영화인이 나오는 경우 등록)
INSERT INTO movie_person(mp_name, mp_birth, mp_contry)
	VALUES('제임스 카메론', '1954-08-16', '캐나다'),
		  ('조 샐다나', '1978-06-19', '미국'),
          ('샘 워싱턴', '1976-08-02', '영국'),
          ('시고니 위버', '1949-10-08', '미국'),
          ('우나 채플린', '1986-06-04', '스페인'),
          ('지오바니 리비시', '1974-12-17', '미국'),
          ('스티븐 랭', '1952-07-11', '미국'),
          ('케이트 윈슬렛', '1975-10-05', '영국');
	
-- 영화정보
INSERT INTO movie(mo_title, mo_contents, mo_age, mo_run, mo_openning_date, mo_state)
	VALUES('아바타-물의 길', 
		'<아바타: 물의 길>은 판도라 행성에서 \'제이크 설리\'와 \'네이티리\'가 이룬 가족이 겪게 되는 무자비한 위협과 
		살아남기 위해 떠나야 하는 긴 여정과 전투, 그리고 견뎌내야 할 상처에 대한 이야기를 그렸다. 
		월드와이드 역대 흥행 순위 1위를 기록한 전편 <아바타>에 이어 제임스 카메론 감독이 13년만에 선보이는 영화로, 
		샘 워싱턴, 조 샐다나, 시고니 위버, 스티븐 랭, 케이트 윈슬렛이 출연하고 존 랜도가 프로듀싱을 맡았다.',
		'12세 이상', 192, '2022-12-14', '현재 상영중'); 

-- 영화 장르 movie_genre
INSERT INTO movie_genre(mg_mo_num, mg_ge_name) 
	VALUES(1, '액션'), (1, '어드벤처'), (1, 'SF'), (1, '스릴러');

-- 영화 참여 movie_casting
INSERT INTO movie_casting(mc_role, mc_mp_num, mc_mo_num)
	VALUES('감독' , 1, 1), ('배우' , 2, 1), ('배우' , 3, 1), ('배우' , 4, 1),
		  ('배우' , 5, 1), ('배우' , 6, 1), ('배우' , 7, 1), ('배우' , 8, 1);
  
-- 트레일러 trailer
INSERT INTO trailer(tr_title, tr_file_name, tr_mo_num)
	VALUES('아바타-물의 길', 'http://h.vod.cgv.co.kr:80/vodCGVa/86072/86072_210699_1200_128_960_540.mp4', 1);

-- 스틸컷 stillcut
INSERT INTO stillcut(st_file_name, st_mo_num)
	VALUES('https://img.cgv.co.kr/Movie/Thumbnail/Poster/000086/86072/86072_1000.jpg', 1);

-- 서울 강남 CGV만 등록해보기
-- 지역 등록
INSERT INTO region 
	VALUES('서울'), ('경기'), ('인천'), ('강원'), ('대전/충청'), 
		  ('대구'), ('부산/울산'), ('경상'), ('광주/전라/제주');

-- 극장 등록
INSERT INTO therter(th_name, th_lot_address, th_address, th_trans_info, 
	th_parking_info, th_number, th_total_cinema, th_total_seat, th_re_name)
	VALUES('CGV강남', '서울특별시 강남구 역삼동 814-6 스타플렉스', '서울특별시 강남구 강남대로 438 (역삼동)',
			'#지하철 2호선 | 강남역 11번 출구 9호선 | 신논현역 5번 출구...', '#주차정보 - 위치: 건물 지하 2F ~ 지하 4F...', 
            '1544-1122', 6, 60, '서울');

-- 영화관 등록
INSERT INTO cinema(ci_name, ci_seat_count, ci_type, ci_th_num)
	VALUES('1관', 10, '3D', 1), ('2관', 10, '2D', 1),
		  ('3관', 10, '3D', 1), ('4관', 10, 'SCREENX 2D', 1),
		  ('5관', 10, '2D', 1), ('6관', 10, '2D', 1);
          
-- 좌석 등록 
/* 조건 : 가격 10.000원
1관 좌석 배치
A1	A2	A3	A4
B1	B2	B3	B4
C1	C2	
2관 좌석 배치
A1	A2	
B1	B2	
C1	C2	
D1	D2
E1	E2
3관 좌석 배치
A1	A2	A3	A4	A5
B1	B2	B3	B4	B5
4관 좌석 배치
A1	A2	A3	
B1	B2	B3
C1	C2	C3	C4
5관 좌석 배치
A1	A2	A3	A4
B1	B2	B3	B4
C1	C2	
6관 좌석 배치
A1	A2	A3	A4
B1	B2	B3	B4
C1	C2	
*/
INSERT INTO seat(se_name, se_state, se_price, se_ci_num)
	VALUES('A1', '가능', 10000, 1), ('A2', '가능', 10000, 1), ('A3', '가능', 10000, 1), ('A4', '가능', 10000, 1), -- 1관
          ('B1', '가능', 10000, 1), ('B2', '가능', 10000, 1), ('B3', '가능', 10000, 1), ('B4', '가능', 10000, 1),
          ('C1', '가능', 10000, 1), ('C2', '가능', 10000, 1), 
          ('A1', '가능', 10000, 2), ('A2', '가능', 10000, 2), ('B1', '가능', 10000, 2), ('B2', '가능', 10000, 2), -- 2관
          ('C1', '가능', 10000, 2), ('C2', '가능', 10000, 2), ('D1', '가능', 10000, 2), ('D2', '가능', 10000, 2),
          ('E1', '가능', 10000, 2), ('E2', '가능', 10000, 2),
		  ('A1', '가능', 10000, 3), ('A2', '가능', 10000, 3), ('A3', '가능', 10000, 3), ('A4', '가능', 10000, 3), -- 3관
          ('A5', '가능', 10000, 3), ('B1', '가능', 10000, 3), ('B2', '가능', 10000, 3), ('B3', '가능', 10000, 3),
          ('B4', '가능', 10000, 3), ('B5', '가능', 10000, 3),
		  ('A1', '가능', 10000, 4), ('A2', '가능', 10000, 4), ('A3', '가능', 10000, 4), ('B1', '가능', 10000, 4), -- 4관
          ('B2', '가능', 10000, 4), ('B3', '가능', 10000, 4), ('C1', '가능', 10000, 4), ('C2', '가능', 10000, 4),
          ('C3', '가능', 10000, 4), ('C4', '가능', 10000, 4),
		  ('A1', '가능', 10000, 5), ('A2', '가능', 10000, 5), ('A3', '가능', 10000, 5), ('A4', '가능', 10000, 5), -- 5관
          ('B1', '가능', 10000, 5), ('B2', '가능', 10000, 5), ('B3', '가능', 10000, 5), ('B4', '가능', 10000, 5),
          ('C1', '가능', 10000, 5), ('C2', '가능', 10000, 5),
		  ('A1', '가능', 10000, 6), ('A2', '가능', 10000, 6), ('A3', '가능', 10000, 6), ('A4', '가능', 10000, 6), -- 6관
          ('B1', '가능', 10000, 6), ('B2', '가능', 10000, 6), ('B3', '가능', 10000, 6), ('B4', '가능', 10000, 6),
          ('C1', '가능', 10000, 6), ('C2', '가능', 10000, 6);

-- 상영시간 등록
INSERT INTO screen_schedule(ss_date, ss_time, ss_total_seat, ss_possible_seat, ss_mo_num, ss_ci_num)
	VALUES('2022-12-18', '09:50:00', 10, 10, 1, 1), ('2022-12-18', '13:30:00', 10, 10, 1, 1), -- 1관 
		  ('2022-12-18', '17:10:00', 10, 10, 1, 1), ('2022-12-18', '20:50:00', 10, 10, 1, 1),
		  ('2022-12-18', '19:00:00', 10, 10, 1, 2), ('2022-12-18', '22:40:00', 10, 10, 1, 2), -- 2관
		  ('2022-12-18', '09:10:00', 10, 10, 1, 3), ('2022-12-18', '12:50:00', 10, 10, 1, 3), -- 3관
          ('2022-12-18', '16:30:00', 10, 10, 1, 3), ('2022-12-18', '20:10:00', 10, 10, 1, 3), 
		  ('2022-12-18', '23:50:00', 10, 10, 1, 3), 
          ('2022-12-18', '10:30:00', 10, 10, 1, 4), ('2022-12-18', '14:10:00', 10, 10, 1, 4), -- 4관
          ('2022-12-18', '17:50:00', 10, 10, 1, 4), ('2022-12-18', '21:30:00', 10, 10, 1, 4), 
          ('2022-12-18', '08:30:00', 10, 10, 1, 5), ('2022-12-18', '12:10:00', 10, 10, 1, 5), -- 5관
          ('2022-12-18', '15:50:00', 10, 10, 1, 5), ('2022-12-18', '19:30:00', 10, 10, 1, 5), 
          ('2022-12-18', '23:10:00', 10, 10, 1, 5),
          ('2022-12-18', '11:10:00', 10, 10, 1, 6), ('2022-12-18', '14:50:00', 10, 10, 1, 6), -- 6관
		  ('2022-12-18', '18:30:00', 10, 10, 1, 6), ('2022-12-18', '22:10:00', 10, 10, 1, 6);
          

SELECT * FROM member;
-- 회원 등록
INSERT INTO member(me_id, me_pw, me_movie_count)
	VALUES('abc', 'abc', 0);

-- 예매 등록
INSERT INTO ticketing(ti_amount, ti_total_price, ti_me_id, ti_ss_num)
	VALUES();

-- 예매 좌석 등록
INSERT INTO ticketing_seat(ts_ti_num, ts_se_num)
	VALUES();






